       PROCEDURE DIVISION.
       A0000-FIRST-PARA SECTION.
       FIRST-PARAGRAPH.
       ACCEPT WS-ID
       MOVE '10' TO WS-ID
       DISPLAY WS-ID